# GetMappedHandle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexBuffer..::..GetMappedHandle Method
VertexBuffer Class See Also
---
Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IntPtr GetMappedHandle()
```

Visual Basic
---
```text
Public Function GetMappedHandle As IntPtr
```

Visual C++
---
```text
public:
IntPtr GetMappedHandle()
```

# ### Return Value
The handle to the mapped memory or nullptr when the buffer is not mapped.
# See Also
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace